[Killed] BlockStatement
Zavrsni Final/registrationform/src/validator.js:1:28
-const validateName = () => {
-    var name = document.getElementById("name").value;
-    if(name.includes(' ')) {
-        var words = name.split(' ');
-        if(words[1]==''){
-            document.getElementById("nameSpan").innerHTML = 'x';
-            document.getElementById("nameMessage").innerHTML = 'Name must be at least 2 words';
-            return false;
-        }
-        document.getElementById("nameSpan").innerHTML = 'OK';
-        document.getElementById("nameMessage").innerHTML = 'Valid data';
-        return true;
-    } else {
-        document.getElementById("nameSpan").innerHTML = 'x';
-        document.getElementById("nameMessage").innerHTML = 'Name must be at least 2 words';
-        return false;
-    }
-}
+const validateName = () => {}
 
 const validateOccupation = () => {
killedBy: Name validation 1 word for name
statusReason: expected '?' to equal 'x'

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:2:40
 const validateName = () => {
-    var name = document.getElementById("name").value;
+    var name = document.getElementById("").value;
     if(name.includes(' ')) {
         var words = name.split(' ');
killedBy: Name validation 1 word for name
statusReason: Cannot read property 'value' of null

[Killed] ConditionalExpression
Zavrsni Final/registrationform/src/validator.js:3:8
 const validateName = () => {
     var name = document.getElementById("name").value;
-    if(name.includes(' ')) {
+    if(false) {
         var words = name.split(' ');
         if(words[1]==''){
killedBy: Name validation 2 words for name
statusReason: expected 'x' to equal 'OK'

[Killed] ConditionalExpression
Zavrsni Final/registrationform/src/validator.js:3:8
 const validateName = () => {
     var name = document.getElementById("name").value;
-    if(name.includes(' ')) {
+    if(true) {
         var words = name.split(' ');
         if(words[1]==''){
killedBy: Name validation 1 word for name
statusReason: expected 'OK' to equal 'x'

[Killed] BlockStatement
Zavrsni Final/registrationform/src/validator.js:5:25
     var name = document.getElementById("name").value;
     if(name.includes(' ')) {
         var words = name.split(' ');
-        if(words[1]==''){
-            document.getElementById("nameSpan").innerHTML = 'x';
-            document.getElementById("nameMessage").innerHTML = 'Name must be at least 2 words';
-            return false;
-        }
+        if(words[1]==''){}
         document.getElementById("nameSpan").innerHTML = 'OK';
         document.getElementById("nameMessage").innerHTML = 'Valid data';
killedBy: Name validation 1 word with space at end
statusReason: expected 'OK' to equal 'x'

[Killed] ConditionalExpression
Zavrsni Final/registrationform/src/validator.js:5:12
     var name = document.getElementById("name").value;
     if(name.includes(' ')) {
         var words = name.split(' ');
-        if(words[1]==''){
+        if(true){
             document.getElementById("nameSpan").innerHTML = 'x';
             document.getElementById("nameMessage").innerHTML = 'Name must be at least 2 words';
killedBy: Name validation 2 words for name
statusReason: expected 'x' to equal 'OK'

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:7:64
         var words = name.split(' ');
         if(words[1]==''){
             document.getElementById("nameSpan").innerHTML = 'x';
-            document.getElementById("nameMessage").innerHTML = 'Name must be at least 2 words';
+            document.getElementById("nameMessage").innerHTML = "";
             return false;
         }
killedBy: Name validation 1 word with space at end
statusReason: expected '' to equal 'Name must be at least 2 words'

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:7:37
         var words = name.split(' ');
         if(words[1]==''){
             document.getElementById("nameSpan").innerHTML = 'x';
-            document.getElementById("nameMessage").innerHTML = 'Name must be at least 2 words';
+            document.getElementById("").innerHTML = 'Name must be at least 2 words';
             return false;
         }
killedBy: Name validation 1 word with space at end
statusReason: Cannot set property 'innerHTML' of null

[Killed] BooleanLiteral
Zavrsni Final/registrationform/src/validator.js:8:20
         if(words[1]==''){
             document.getElementById("nameSpan").innerHTML = 'x';
             document.getElementById("nameMessage").innerHTML = 'Name must be at least 2 words';
-            return false;
+            return true;
         }
         document.getElementById("nameSpan").innerHTML = 'OK';
killedBy: Name validation 1 word with space at end
statusReason: expected true to equal false

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:10:33
             document.getElementById("nameMessage").innerHTML = 'Name must be at least 2 words';
             return false;
         }
-        document.getElementById("nameSpan").innerHTML = 'OK';
+        document.getElementById("").innerHTML = 'OK';
         document.getElementById("nameMessage").innerHTML = 'Valid data';
         return true;
killedBy: Name validation 2 words for name
statusReason: Cannot set property 'innerHTML' of null

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:11:60
             return false;
         }
         document.getElementById("nameSpan").innerHTML = 'OK';
-        document.getElementById("nameMessage").innerHTML = 'Valid data';
+        document.getElementById("nameMessage").innerHTML = "";
         return true;
     } else {
killedBy: Name validation 2 words for name
statusReason: expected '' to equal 'Valid data'

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:11:33
             return false;
         }
         document.getElementById("nameSpan").innerHTML = 'OK';
-        document.getElementById("nameMessage").innerHTML = 'Valid data';
+        document.getElementById("").innerHTML = 'Valid data';
         return true;
     } else {
killedBy: Name validation 2 words for name
statusReason: Cannot set property 'innerHTML' of null

[Killed] BooleanLiteral
Zavrsni Final/registrationform/src/validator.js:12:16
         }
         document.getElementById("nameSpan").innerHTML = 'OK';
         document.getElementById("nameMessage").innerHTML = 'Valid data';
-        return true;
+        return false;
     } else {
         document.getElementById("nameSpan").innerHTML = 'x';
killedBy: Name validation 2 words for name
statusReason: expected false to equal true

[Killed] BlockStatement
Zavrsni Final/registrationform/src/validator.js:13:12
         document.getElementById("nameSpan").innerHTML = 'OK';
         document.getElementById("nameMessage").innerHTML = 'Valid data';
         return true;
-    } else {
-        document.getElementById("nameSpan").innerHTML = 'x';
-        document.getElementById("nameMessage").innerHTML = 'Name must be at least 2 words';
-        return false;
-    }
+    } else {}
 }
 
killedBy: Name validation 1 word for name
statusReason: expected '?' to equal 'x'

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:14:33
         document.getElementById("nameMessage").innerHTML = 'Valid data';
         return true;
     } else {
-        document.getElementById("nameSpan").innerHTML = 'x';
+        document.getElementById("").innerHTML = 'x';
         document.getElementById("nameMessage").innerHTML = 'Name must be at least 2 words';
         return false;
killedBy: Name validation 1 word for name
statusReason: Cannot set property 'innerHTML' of null

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:14:57
         document.getElementById("nameMessage").innerHTML = 'Valid data';
         return true;
     } else {
-        document.getElementById("nameSpan").innerHTML = 'x';
+        document.getElementById("nameSpan").innerHTML = "";
         document.getElementById("nameMessage").innerHTML = 'Name must be at least 2 words';
         return false;
killedBy: Name validation 1 word for name
statusReason: expected '' to equal 'x'

[Killed] BlockStatement
Zavrsni Final/registrationform/src/validator.js:20:34
     }
 }
 
-const validateOccupation = () => {
-    var occupation = document.getElementById("occupation").value;
-    if(occupation == "" || (occupation.length >= 5 && occupation.length <= 15)) {
-        document.getElementById("occupationSpan").innerHTML = 'OK';
-        document.getElementById("occupationMessage").innerHTML = 'Valid data';
-        return true;
-    } 
-    document.getElementById("occupationSpan").innerHTML = 'x';
-    document.getElementById("occupationMessage").innerHTML = 'Minimum 5 chars, maximum 15';
-    return false;
-}
+const validateOccupation = () => {}
 
 const validateNumber = () => {
killedBy: Occupation validation Empty field
statusReason: expected '?' to equal 'OK'

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:21:46
 }
 
 const validateOccupation = () => {
-    var occupation = document.getElementById("occupation").value;
+    var occupation = document.getElementById("").value;
     if(occupation == "" || (occupation.length >= 5 && occupation.length <= 15)) {
         document.getElementById("occupationSpan").innerHTML = 'OK';
killedBy: Occupation validation Empty field
statusReason: Cannot read property 'value' of null

[Killed] ConditionalExpression
Zavrsni Final/registrationform/src/validator.js:22:29
 
 const validateOccupation = () => {
     var occupation = document.getElementById("occupation").value;
-    if(occupation == "" || (occupation.length >= 5 && occupation.length <= 15)) {
+    if(occupation == "" || (false)) {
         document.getElementById("occupationSpan").innerHTML = 'OK';
         document.getElementById("occupationMessage").innerHTML = 'Valid data';
killedBy: Occupation validation 8 characters
statusReason: expected 'x' to equal 'OK'

[Killed] ConditionalExpression
Zavrsni Final/registrationform/src/validator.js:22:29
 
 const validateOccupation = () => {
     var occupation = document.getElementById("occupation").value;
-    if(occupation == "" || (occupation.length >= 5 && occupation.length <= 15)) {
+    if(occupation == "" || (false && occupation.length <= 15)) {
         document.getElementById("occupationSpan").innerHTML = 'OK';
         document.getElementById("occupationMessage").innerHTML = 'Valid data';
killedBy: Occupation validation 8 characters
statusReason: expected 'x' to equal 'OK'

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:23:63
 const validateOccupation = () => {
     var occupation = document.getElementById("occupation").value;
     if(occupation == "" || (occupation.length >= 5 && occupation.length <= 15)) {
-        document.getElementById("occupationSpan").innerHTML = 'OK';
+        document.getElementById("occupationSpan").innerHTML = "";
         document.getElementById("occupationMessage").innerHTML = 'Valid data';
         return true;
killedBy: Occupation validation Empty field
statusReason: expected '' to equal 'OK'

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:24:66
     var occupation = document.getElementById("occupation").value;
     if(occupation == "" || (occupation.length >= 5 && occupation.length <= 15)) {
         document.getElementById("occupationSpan").innerHTML = 'OK';
-        document.getElementById("occupationMessage").innerHTML = 'Valid data';
+        document.getElementById("occupationMessage").innerHTML = "";
         return true;
     } 
killedBy: Occupation validation Empty field
statusReason: expected '' to equal 'Valid data'

[Killed] BooleanLiteral
Zavrsni Final/registrationform/src/validator.js:25:16
     if(occupation == "" || (occupation.length >= 5 && occupation.length <= 15)) {
         document.getElementById("occupationSpan").innerHTML = 'OK';
         document.getElementById("occupationMessage").innerHTML = 'Valid data';
-        return true;
+        return false;
     } 
     document.getElementById("occupationSpan").innerHTML = 'x';
killedBy: Occupation validation Empty field
statusReason: expected false to equal true

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:27:59
         document.getElementById("occupationMessage").innerHTML = 'Valid data';
         return true;
     } 
-    document.getElementById("occupationSpan").innerHTML = 'x';
+    document.getElementById("occupationSpan").innerHTML = "";
     document.getElementById("occupationMessage").innerHTML = 'Minimum 5 chars, maximum 15';
     return false;
killedBy: Occupation validation Less than 5 characters
statusReason: expected '' to equal 'x'

[Killed] BooleanLiteral
Zavrsni Final/registrationform/src/validator.js:29:12
     } 
     document.getElementById("occupationSpan").innerHTML = 'x';
     document.getElementById("occupationMessage").innerHTML = 'Minimum 5 chars, maximum 15';
-    return false;
+    return true;
 }
 
killedBy: Occupation validation Less than 5 characters
statusReason: expected true to equal false

[Killed] BlockStatement
Zavrsni Final/registrationform/src/validator.js:32:30
     return false;
 }
 
-const validateNumber = () => {
-    var number = document.getElementById("number").value;
-    if(parseInt(number) < 10 || parseInt(number) > 100 || number == '') {
-        document.getElementById("numberSpan").innerHTML = 'x';
-        document.getElementById("numberMessage").innerHTML = 'Number must be between 10 and 100';
-        return false;
-    }
-        document.getElementById("numberSpan").innerHTML = 'OK';
-        document.getElementById("numberMessage").innerHTML = 'Valid data';
-        return true;
-}
+const validateNumber = () => {}
 
 const validateTime = () => {
killedBy: Number validation 8 as input
statusReason: expected '?' to equal 'x'

[Killed] EqualityOperator
Zavrsni Final/registrationform/src/validator.js:34:8
 
 const validateNumber = () => {
     var number = document.getElementById("number").value;
-    if(parseInt(number) < 10 || parseInt(number) > 100 || number == '') {
+    if(parseInt(number) >= 10 || parseInt(number) > 100 || number == '') {
         document.getElementById("numberSpan").innerHTML = 'x';
         document.getElementById("numberMessage").innerHTML = 'Number must be between 10 and 100';
killedBy: Number validation 8 as input
statusReason: expected 'OK' to equal 'x'

[Killed] ConditionalExpression
Zavrsni Final/registrationform/src/validator.js:34:59
 
 const validateNumber = () => {
     var number = document.getElementById("number").value;
-    if(parseInt(number) < 10 || parseInt(number) > 100 || number == '') {
+    if(parseInt(number) < 10 || parseInt(number) > 100 || true) {
         document.getElementById("numberSpan").innerHTML = 'x';
         document.getElementById("numberMessage").innerHTML = 'Number must be between 10 and 100';
killedBy: Number validation 434 as input
statusReason: expected 'x' to equal 'OK'

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:36:62
     var number = document.getElementById("number").value;
     if(parseInt(number) < 10 || parseInt(number) > 100 || number == '') {
         document.getElementById("numberSpan").innerHTML = 'x';
-        document.getElementById("numberMessage").innerHTML = 'Number must be between 10 and 100';
+        document.getElementById("numberMessage").innerHTML = "";
         return false;
     }
killedBy: Number validation 8 as input
statusReason: expected '' to equal 'Number must be between 10 and 100'

[Killed] BooleanLiteral
Zavrsni Final/registrationform/src/validator.js:37:16
     if(parseInt(number) < 10 || parseInt(number) > 100 || number == '') {
         document.getElementById("numberSpan").innerHTML = 'x';
         document.getElementById("numberMessage").innerHTML = 'Number must be between 10 and 100';
-        return false;
+        return true;
     }
         document.getElementById("numberSpan").innerHTML = 'OK';
killedBy: Number validation 8 as input
statusReason: expected true to equal false

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:40:62
         return false;
     }
         document.getElementById("numberSpan").innerHTML = 'OK';
-        document.getElementById("numberMessage").innerHTML = 'Valid data';
+        document.getElementById("numberMessage").innerHTML = "";
         return true;
 }
killedBy: Number validation 434 as input
statusReason: expected '' to equal 'Valid data'

[Killed] BooleanLiteral
Zavrsni Final/registrationform/src/validator.js:41:16
     }
         document.getElementById("numberSpan").innerHTML = 'OK';
         document.getElementById("numberMessage").innerHTML = 'Valid data';
-        return true;
+        return false;
 }
 
killedBy: Number validation 434 as input
statusReason: expected false to equal true

[Killed] BlockStatement
Zavrsni Final/registrationform/src/validator.js:44:28
         return true;
 }
 
-const validateTime = () => {
-    var time = document.getElementById("time").value;
-    var begin = "08:00";
-    var end = "20:00";
-    if(time < begin || time > end) {
-        document.getElementById("timeSpan").innerHTML = 'x';
-        document.getElementById("timeMessage").innerHTML = 'Time should be from 08:00 to 20:00';
-        return false;
-    }
-    document.getElementById("timeSpan").innerHTML = 'OK';
-    document.getElementById("timeMessage").innerHTML = 'Valid data';
-    return true;
-}
+const validateTime = () => {}
 
 const validatePassword = () => {
killedBy: Time validation Wrong time
statusReason: expected '?' to equal 'x'

[Killed] ConditionalExpression
Zavrsni Final/registrationform/src/validator.js:48:24
     var time = document.getElementById("time").value;
     var begin = "08:00";
     var end = "20:00";
-    if(time < begin || time > end) {
+    if(time < begin || true) {
         document.getElementById("timeSpan").innerHTML = 'x';
         document.getElementById("timeMessage").innerHTML = 'Time should be from 08:00 to 20:00';
killedBy: Time validation Correct time
statusReason: expected 'x' to equal 'OK'

[Killed] EqualityOperator
Zavrsni Final/registrationform/src/validator.js:48:24
     var time = document.getElementById("time").value;
     var begin = "08:00";
     var end = "20:00";
-    if(time < begin || time > end) {
+    if(time < begin || time <= end) {
         document.getElementById("timeSpan").innerHTML = 'x';
         document.getElementById("timeMessage").innerHTML = 'Time should be from 08:00 to 20:00';
killedBy: Time validation Correct time
statusReason: expected 'x' to equal 'OK'

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:49:33
     var begin = "08:00";
     var end = "20:00";
     if(time < begin || time > end) {
-        document.getElementById("timeSpan").innerHTML = 'x';
+        document.getElementById("").innerHTML = 'x';
         document.getElementById("timeMessage").innerHTML = 'Time should be from 08:00 to 20:00';
         return false;
killedBy: Time validation Wrong time
statusReason: Cannot set property 'innerHTML' of null

[Killed] BooleanLiteral
Zavrsni Final/registrationform/src/validator.js:51:16
     if(time < begin || time > end) {
         document.getElementById("timeSpan").innerHTML = 'x';
         document.getElementById("timeMessage").innerHTML = 'Time should be from 08:00 to 20:00';
-        return false;
+        return true;
     }
     document.getElementById("timeSpan").innerHTML = 'OK';
killedBy: Time validation Wrong time
statusReason: expected true to equal false

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:54:56
         return false;
     }
     document.getElementById("timeSpan").innerHTML = 'OK';
-    document.getElementById("timeMessage").innerHTML = 'Valid data';
+    document.getElementById("timeMessage").innerHTML = "";
     return true;
 }
killedBy: Time validation Correct time
statusReason: expected '' to equal 'Valid data'

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:54:29
         return false;
     }
     document.getElementById("timeSpan").innerHTML = 'OK';
-    document.getElementById("timeMessage").innerHTML = 'Valid data';
+    document.getElementById("").innerHTML = 'Valid data';
     return true;
 }
killedBy: Time validation Correct time
statusReason: Cannot set property 'innerHTML' of null

[Killed] BooleanLiteral
Zavrsni Final/registrationform/src/validator.js:55:12
     }
     document.getElementById("timeSpan").innerHTML = 'OK';
     document.getElementById("timeMessage").innerHTML = 'Valid data';
-    return true;
+    return false;
 }
 
killedBy: Time validation Correct time
statusReason: expected false to equal true

[Killed] BlockStatement
Zavrsni Final/registrationform/src/validator.js:58:32
     return true;
 }
 
-const validatePassword = () => {
-    var password = document.getElementById("password").value;
-    if(password.length == 6 || password.length == 8) {
-        document.getElementById("passwordSpan").innerHTML = 'OK';
-        document.getElementById("passwordMessage").innerHTML = 'Valid data';
-        return true;
-    }
-    document.getElementById("passwordSpan").innerHTML = 'x';
-        document.getElementById("passwordMessage").innerHTML = 'Should be of length 6 OR 8 characters';
-        return false;
-}
+const validatePassword = () => {}
 
 const validateRepeat = () => {
killedBy: Password validation 7 characters
statusReason: expected '?' to equal 'x'

[Killed] EqualityOperator
Zavrsni Final/registrationform/src/validator.js:60:8
 
 const validatePassword = () => {
     var password = document.getElementById("password").value;
-    if(password.length == 6 || password.length == 8) {
+    if(password.length != 6 || password.length == 8) {
         document.getElementById("passwordSpan").innerHTML = 'OK';
         document.getElementById("passwordMessage").innerHTML = 'Valid data';
killedBy: Password validation 7 characters
statusReason: expected 'OK' to equal 'x'

[Killed] LogicalOperator
Zavrsni Final/registrationform/src/validator.js:60:8
 
 const validatePassword = () => {
     var password = document.getElementById("password").value;
-    if(password.length == 6 || password.length == 8) {
+    if(password.length == 6 && password.length == 8) {
         document.getElementById("passwordSpan").innerHTML = 'OK';
         document.getElementById("passwordMessage").innerHTML = 'Valid data';
killedBy: Password validation 8 characters
statusReason: expected 'x' to equal 'OK'

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:62:33
     var password = document.getElementById("password").value;
     if(password.length == 6 || password.length == 8) {
         document.getElementById("passwordSpan").innerHTML = 'OK';
-        document.getElementById("passwordMessage").innerHTML = 'Valid data';
+        document.getElementById("").innerHTML = 'Valid data';
         return true;
     }
killedBy: Password validation 8 characters
statusReason: Cannot set property 'innerHTML' of null

[Killed] BooleanLiteral
Zavrsni Final/registrationform/src/validator.js:63:16
     if(password.length == 6 || password.length == 8) {
         document.getElementById("passwordSpan").innerHTML = 'OK';
         document.getElementById("passwordMessage").innerHTML = 'Valid data';
-        return true;
+        return false;
     }
     document.getElementById("passwordSpan").innerHTML = 'x';
killedBy: Password validation 8 characters
statusReason: expected false to equal true

[Killed] BooleanLiteral
Zavrsni Final/registrationform/src/validator.js:67:16
     }
     document.getElementById("passwordSpan").innerHTML = 'x';
         document.getElementById("passwordMessage").innerHTML = 'Should be of length 6 OR 8 characters';
-        return false;
+        return true;
 }
 
killedBy: Password validation 7 characters
statusReason: expected true to equal false

[Killed] BlockStatement
Zavrsni Final/registrationform/src/validator.js:70:30
         return false;
 }
 
-const validateRepeat = () => {
-    if(!validatePassword()) return false;
-    var password = document.getElementById("password").value;
-    var rePassword = document.getElementById("rePassword").value;
-    if(password != rePassword) {
-        document.getElementById("rePassword").value = "";
-        return false;
-    }
-    return true;
-}
+const validateRepeat = () => {}
 
 const validateTelephone = () => {
killedBy: Password validation Reset password should be OK
statusReason: expected undefined to equal true

[Killed] BooleanLiteral
Zavrsni Final/registrationform/src/validator.js:71:36
 }
 
 const validateRepeat = () => {
-    if(!validatePassword()) return false;
+    if(!validatePassword()) return true;
     var password = document.getElementById("password").value;
     var rePassword = document.getElementById("rePassword").value;
killedBy: Password validation Reset password should be NOT OK 2
statusReason: expected true to equal false

[Killed] BooleanLiteral
Zavrsni Final/registrationform/src/validator.js:71:8
 }
 
 const validateRepeat = () => {
-    if(!validatePassword()) return false;
+    if(validatePassword()) return false;
     var password = document.getElementById("password").value;
     var rePassword = document.getElementById("rePassword").value;
killedBy: Password validation Reset password should be OK
statusReason: expected false to equal true

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:73:46
 const validateRepeat = () => {
     if(!validatePassword()) return false;
     var password = document.getElementById("password").value;
-    var rePassword = document.getElementById("rePassword").value;
+    var rePassword = document.getElementById("").value;
     if(password != rePassword) {
         document.getElementById("rePassword").value = "";
killedBy: Password validation Reset password should be OK
statusReason: Cannot read property 'value' of null

[Killed] EqualityOperator
Zavrsni Final/registrationform/src/validator.js:74:8
     if(!validatePassword()) return false;
     var password = document.getElementById("password").value;
     var rePassword = document.getElementById("rePassword").value;
-    if(password != rePassword) {
+    if(password == rePassword) {
         document.getElementById("rePassword").value = "";
         return false;
killedBy: Password validation Reset password should be OK
statusReason: expected false to equal true

[Killed] ConditionalExpression
Zavrsni Final/registrationform/src/validator.js:74:8
     if(!validatePassword()) return false;
     var password = document.getElementById("password").value;
     var rePassword = document.getElementById("rePassword").value;
-    if(password != rePassword) {
+    if(false) {
         document.getElementById("rePassword").value = "";
         return false;
killedBy: Password validation Reset password should be NOT OK
statusReason: expected true to equal false

[Killed] BooleanLiteral
Zavrsni Final/registrationform/src/validator.js:76:16
     var rePassword = document.getElementById("rePassword").value;
     if(password != rePassword) {
         document.getElementById("rePassword").value = "";
-        return false;
+        return true;
     }
     return true;
killedBy: Password validation Reset password should be NOT OK
statusReason: expected true to equal false

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:82:45
 }
 
 const validateTelephone = () => {
-    var telephone = document.getElementById("telephone").value;
+    var telephone = document.getElementById("").value;
     if(telephone.length < 12) {
         document.getElementById("telSpan").innerHTML = 'x';
killedBy: Telephone validation Should be invalid telephone
statusReason: Cannot read property 'value' of null

[Killed] ConditionalExpression
Zavrsni Final/registrationform/src/validator.js:83:8
 
 const validateTelephone = () => {
     var telephone = document.getElementById("telephone").value;
-    if(telephone.length < 12) {
+    if(true) {
         document.getElementById("telSpan").innerHTML = 'x';
         document.getElementById("telMessage").innerHTML = 'Notice that for a phone number user must input more than 11 digits';
killedBy: Telephone validation Should be invalid telephone
statusReason: expected 'Notice that for a phone number user must input more than 11 digits' to equal 'Notice that for a phone number user must input a  sign and digits'

[Killed] BlockStatement
Zavrsni Final/registrationform/src/validator.js:83:31
 
 const validateTelephone = () => {
     var telephone = document.getElementById("telephone").value;
-    if(telephone.length < 12) {
-        document.getElementById("telSpan").innerHTML = 'x';
-        document.getElementById("telMessage").innerHTML = 'Notice that for a phone number user must input more than 11 digits';
-        return false;
-    }else{
+    if(telephone.length < 12) {}else{
         if(telephone[0] == '+') {
             for(var i = 0; i < telephone.length; i++) {
killedBy: Telephone validation Should be invalid telephone 2
statusReason: expected '?' to equal 'x'

[Killed] BooleanLiteral
Zavrsni Final/registrationform/src/validator.js:86:16
     if(telephone.length < 12) {
         document.getElementById("telSpan").innerHTML = 'x';
         document.getElementById("telMessage").innerHTML = 'Notice that for a phone number user must input more than 11 digits';
-        return false;
+        return true;
     }else{
         if(telephone[0] == '+') {
killedBy: Telephone validation Should be invalid telephone 2
statusReason: expected true to equal false
