[Killed] BlockStatement
Zavrsni Final/registrationform/src/validator.js:87:10
         document.getElementById("telSpan").innerHTML = 'x';
         document.getElementById("telMessage").innerHTML = 'Notice that for a phone number user must input more than 11 digits';
         return false;
-    }else{
-        if(telephone[0] == '+') {
-            for(var i = 0; i < telephone.length; i++) {
-                if(i != 0) {
-                    if(!(telephone[i] >= '0' && telephone[i] <= '9')) {
-                        document.getElementById("telSpan").innerHTML = 'x';
-                        document.getElementById("telMessage").innerHTML = 'Notice that for a phone number user must input all numbers';
-                        return false;
-                    }
-                }
-            }
-            document.getElementById("telSpan").innerHTML = 'OK';
-            document.getElementById("telMessage").innerHTML = 'Valid data';
-            return true;
-        }else{
-            document.getElementById("telSpan").innerHTML = 'x';
-            document.getElementById("telMessage").innerHTML = 'Notice that for a phone number user must input a '+' sign and digits';
-            return false;
-        }
-}
+    }else{}
 }
 const validatePicture = (fileInput) => {
killedBy: Telephone validation Should be invalid telephone
statusReason: expected '?' to equal 'x'

[Killed] EqualityOperator
Zavrsni Final/registrationform/src/validator.js:88:12
         document.getElementById("telMessage").innerHTML = 'Notice that for a phone number user must input more than 11 digits';
         return false;
     }else{
-        if(telephone[0] == '+') {
+        if(telephone[0] != '+') {
             for(var i = 0; i < telephone.length; i++) {
                 if(i != 0) {
killedBy: Telephone validation Should be invalid telephone
statusReason: expected 'OK' to equal 'x'

[Killed] BlockStatement
Zavrsni Final/registrationform/src/validator.js:88:33
         document.getElementById("telMessage").innerHTML = 'Notice that for a phone number user must input more than 11 digits';
         return false;
     }else{
-        if(telephone[0] == '+') {
-            for(var i = 0; i < telephone.length; i++) {
-                if(i != 0) {
-                    if(!(telephone[i] >= '0' && telephone[i] <= '9')) {
-                        document.getElementById("telSpan").innerHTML = 'x';
-                        document.getElementById("telMessage").innerHTML = 'Notice that for a phone number user must input all numbers';
-                        return false;
-                    }
-                }
-            }
-            document.getElementById("telSpan").innerHTML = 'OK';
-            document.getElementById("telMessage").innerHTML = 'Valid data';
-            return true;
-        }else{
+        if(telephone[0] == '+') {}else{
             document.getElementById("telSpan").innerHTML = 'x';
             document.getElementById("telMessage").innerHTML = 'Notice that for a phone number user must input a '+' sign and digits';
killedBy: Telephone validation Should be invalid telephone 4
statusReason: expected '?' to equal 'x'

[Killed] BlockStatement
Zavrsni Final/registrationform/src/validator.js:89:55
         return false;
     }else{
         if(telephone[0] == '+') {
-            for(var i = 0; i < telephone.length; i++) {
-                if(i != 0) {
-                    if(!(telephone[i] >= '0' && telephone[i] <= '9')) {
-                        document.getElementById("telSpan").innerHTML = 'x';
-                        document.getElementById("telMessage").innerHTML = 'Notice that for a phone number user must input all numbers';
-                        return false;
-                    }
-                }
-            }
+            for(var i = 0; i < telephone.length; i++) {}
             document.getElementById("telSpan").innerHTML = 'OK';
             document.getElementById("telMessage").innerHTML = 'Valid data';
killedBy: Telephone validation Should be invalid telephone 4
statusReason: expected 'OK' to equal 'x'

[Killed] EqualityOperator
Zavrsni Final/registrationform/src/validator.js:89:28
         return false;
     }else{
         if(telephone[0] == '+') {
-            for(var i = 0; i < telephone.length; i++) {
+            for(var i = 0; i >= telephone.length; i++) {
                 if(i != 0) {
                     if(!(telephone[i] >= '0' && telephone[i] <= '9')) {
killedBy: Telephone validation Should be invalid telephone 4
statusReason: expected 'OK' to equal 'x'

[Killed] BlockStatement
Zavrsni Final/registrationform/src/validator.js:90:28
     }else{
         if(telephone[0] == '+') {
             for(var i = 0; i < telephone.length; i++) {
-                if(i != 0) {
-                    if(!(telephone[i] >= '0' && telephone[i] <= '9')) {
-                        document.getElementById("telSpan").innerHTML = 'x';
-                        document.getElementById("telMessage").innerHTML = 'Notice that for a phone number user must input all numbers';
-                        return false;
-                    }
-                }
+                if(i != 0) {}
             }
             document.getElementById("telSpan").innerHTML = 'OK';
killedBy: Telephone validation Should be invalid telephone 4
statusReason: expected 'OK' to equal 'x'

[Killed] ConditionalExpression
Zavrsni Final/registrationform/src/validator.js:90:20
     }else{
         if(telephone[0] == '+') {
             for(var i = 0; i < telephone.length; i++) {
-                if(i != 0) {
+                if(false) {
                     if(!(telephone[i] >= '0' && telephone[i] <= '9')) {
                         document.getElementById("telSpan").innerHTML = 'x';
killedBy: Telephone validation Should be invalid telephone 4
statusReason: expected 'OK' to equal 'x'

[Killed] ConditionalExpression
Zavrsni Final/registrationform/src/validator.js:91:49
         if(telephone[0] == '+') {
             for(var i = 0; i < telephone.length; i++) {
                 if(i != 0) {
-                    if(!(telephone[i] >= '0' && telephone[i] <= '9')) {
+                    if(!(telephone[i] >= '0' && true)) {
                         document.getElementById("telSpan").innerHTML = 'x';
                         document.getElementById("telMessage").innerHTML = 'Notice that for a phone number user must input all numbers';
killedBy: Telephone validation Should be invalid telephone 4
statusReason: expected 'OK' to equal 'x'

[Killed] BooleanLiteral
Zavrsni Final/registrationform/src/validator.js:91:24
         if(telephone[0] == '+') {
             for(var i = 0; i < telephone.length; i++) {
                 if(i != 0) {
-                    if(!(telephone[i] >= '0' && telephone[i] <= '9')) {
+                    if(telephone[i] >= '0' && telephone[i] <= '9') {
                         document.getElementById("telSpan").innerHTML = 'x';
                         document.getElementById("telMessage").innerHTML = 'Notice that for a phone number user must input all numbers';
killedBy: Telephone validation Should be invalid telephone 4
statusReason: expected 'OK' to equal 'x'

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:92:72
             for(var i = 0; i < telephone.length; i++) {
                 if(i != 0) {
                     if(!(telephone[i] >= '0' && telephone[i] <= '9')) {
-                        document.getElementById("telSpan").innerHTML = 'x';
+                        document.getElementById("telSpan").innerHTML = "";
                         document.getElementById("telMessage").innerHTML = 'Notice that for a phone number user must input all numbers';
                         return false;
killedBy: Telephone validation Should be invalid telephone 4
statusReason: expected '' to equal 'x'

[Killed] BooleanLiteral
Zavrsni Final/registrationform/src/validator.js:94:32
                     if(!(telephone[i] >= '0' && telephone[i] <= '9')) {
                         document.getElementById("telSpan").innerHTML = 'x';
                         document.getElementById("telMessage").innerHTML = 'Notice that for a phone number user must input all numbers';
-                        return false;
+                        return true;
                     }
                 }
killedBy: Telephone validation Should be invalid telephone 4
statusReason: expected true to equal false

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:98:37
                     }
                 }
             }
-            document.getElementById("telSpan").innerHTML = 'OK';
+            document.getElementById("").innerHTML = 'OK';
             document.getElementById("telMessage").innerHTML = 'Valid data';
             return true;
killedBy: Telephone validation Should be valid telephone
statusReason: Cannot set property 'innerHTML' of null

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:98:60
                     }
                 }
             }
-            document.getElementById("telSpan").innerHTML = 'OK';
+            document.getElementById("telSpan").innerHTML = "";
             document.getElementById("telMessage").innerHTML = 'Valid data';
             return true;
killedBy: Telephone validation Should be valid telephone
statusReason: expected '' to equal 'OK'

[Killed] BooleanLiteral
Zavrsni Final/registrationform/src/validator.js:100:20
             }
             document.getElementById("telSpan").innerHTML = 'OK';
             document.getElementById("telMessage").innerHTML = 'Valid data';
-            return true;
+            return false;
         }else{
             document.getElementById("telSpan").innerHTML = 'x';
killedBy: Telephone validation Should be valid telephone
statusReason: expected false to equal true

[Killed] BlockStatement
Zavrsni Final/registrationform/src/validator.js:101:14
             document.getElementById("telSpan").innerHTML = 'OK';
             document.getElementById("telMessage").innerHTML = 'Valid data';
             return true;
-        }else{
-            document.getElementById("telSpan").innerHTML = 'x';
-            document.getElementById("telMessage").innerHTML = 'Notice that for a phone number user must input a '+' sign and digits';
-            return false;
-        }
+        }else{}
 }
 }
killedBy: Telephone validation Should be invalid telephone
statusReason: expected '?' to equal 'x'

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:102:37
             document.getElementById("telMessage").innerHTML = 'Valid data';
             return true;
         }else{
-            document.getElementById("telSpan").innerHTML = 'x';
+            document.getElementById("").innerHTML = 'x';
             document.getElementById("telMessage").innerHTML = 'Notice that for a phone number user must input a '+' sign and digits';
             return false;
killedBy: Telephone validation Should be invalid telephone
statusReason: Cannot set property 'innerHTML' of null

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:103:37
             return true;
         }else{
             document.getElementById("telSpan").innerHTML = 'x';
-            document.getElementById("telMessage").innerHTML = 'Notice that for a phone number user must input a '+' sign and digits';
+            document.getElementById("").innerHTML = 'Notice that for a phone number user must input a '+' sign and digits';
             return false;
         }
killedBy: Telephone validation Should be invalid telephone
statusReason: Cannot set property 'innerHTML' of null

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:103:115
             return true;
         }else{
             document.getElementById("telSpan").innerHTML = 'x';
-            document.getElementById("telMessage").innerHTML = 'Notice that for a phone number user must input a '+' sign and digits';
+            document.getElementById("telMessage").innerHTML = 'Notice that for a phone number user must input a '+"";
             return false;
         }
killedBy: Telephone validation Should be invalid telephone
statusReason: expected 'Notice that for a phone number user must input a ' to equal 'Notice that for a phone number user must input a  sign and digits'

[Killed] BooleanLiteral
Zavrsni Final/registrationform/src/validator.js:104:20
         }else{
             document.getElementById("telSpan").innerHTML = 'x';
             document.getElementById("telMessage").innerHTML = 'Notice that for a phone number user must input a '+' sign and digits';
-            return false;
+            return true;
         }
 }
killedBy: Telephone validation Should be invalid telephone
statusReason: expected true to equal false

[Killed] BlockStatement
Zavrsni Final/registrationform/src/validator.js:108:40
         }
 }
 }
-const validatePicture = (fileInput) => {
-    var fileType = fileInput.split('.').pop();
-    var supportedTypes = ['JPG','JPEG','PNG']
-    if(!supportedTypes.includes(fileType.toUpperCase())) {
-        document.getElementById("fileSpan").innerHTML = 'x';
-        document.getElementById("fileMessage").innerHTML = 'JPG, PNG and JPEG allowed';
-        return false;
-    }
-    document.getElementById("fileSpan").innerHTML = 'OK';
-    document.getElementById("fileMessage").innerHTML = 'Valid data';
-    return true;
-}
+const validatePicture = (fileInput) => {}
 
 const validate = () => {
killedBy: Picture validation No picture
statusReason: expected '?' to equal 'x'

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:109:36
 }
 }
 const validatePicture = (fileInput) => {
-    var fileType = fileInput.split('.').pop();
+    var fileType = fileInput.split("").pop();
     var supportedTypes = ['JPG','JPEG','PNG']
     if(!supportedTypes.includes(fileType.toUpperCase())) {
killedBy: Telephone validation Should be valid telephone
statusReason: Cannot read property 'toUpperCase' of undefined

[Killed] ArrayDeclaration
Zavrsni Final/registrationform/src/validator.js:110:26
 }
 const validatePicture = (fileInput) => {
     var fileType = fileInput.split('.').pop();
-    var supportedTypes = ['JPG','JPEG','PNG']
+    var supportedTypes = []
     if(!supportedTypes.includes(fileType.toUpperCase())) {
         document.getElementById("fileSpan").innerHTML = 'x';
killedBy: Picture validation Correct picture
statusReason: expected 'x' to equal 'OK'

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:110:27
 }
 const validatePicture = (fileInput) => {
     var fileType = fileInput.split('.').pop();
-    var supportedTypes = ['JPG','JPEG','PNG']
+    var supportedTypes = ["",'JPEG','PNG']
     if(!supportedTypes.includes(fileType.toUpperCase())) {
         document.getElementById("fileSpan").innerHTML = 'x';
killedBy: Picture validation No picture
statusReason: expected 'OK' to equal 'x'

[Killed] ConditionalExpression
Zavrsni Final/registrationform/src/validator.js:111:8
 const validatePicture = (fileInput) => {
     var fileType = fileInput.split('.').pop();
     var supportedTypes = ['JPG','JPEG','PNG']
-    if(!supportedTypes.includes(fileType.toUpperCase())) {
+    if(true) {
         document.getElementById("fileSpan").innerHTML = 'x';
         document.getElementById("fileMessage").innerHTML = 'JPG, PNG and JPEG allowed';
killedBy: Picture validation Correct picture
statusReason: expected 'x' to equal 'OK'

[Killed] ConditionalExpression
Zavrsni Final/registrationform/src/validator.js:111:8
 const validatePicture = (fileInput) => {
     var fileType = fileInput.split('.').pop();
     var supportedTypes = ['JPG','JPEG','PNG']
-    if(!supportedTypes.includes(fileType.toUpperCase())) {
+    if(false) {
         document.getElementById("fileSpan").innerHTML = 'x';
         document.getElementById("fileMessage").innerHTML = 'JPG, PNG and JPEG allowed';
killedBy: Picture validation No picture
statusReason: expected 'OK' to equal 'x'

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:112:33
     var fileType = fileInput.split('.').pop();
     var supportedTypes = ['JPG','JPEG','PNG']
     if(!supportedTypes.includes(fileType.toUpperCase())) {
-        document.getElementById("fileSpan").innerHTML = 'x';
+        document.getElementById("").innerHTML = 'x';
         document.getElementById("fileMessage").innerHTML = 'JPG, PNG and JPEG allowed';
         return false;
killedBy: Telephone validation Should be valid telephone
statusReason: Cannot set property 'innerHTML' of null

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:113:33
     var supportedTypes = ['JPG','JPEG','PNG']
     if(!supportedTypes.includes(fileType.toUpperCase())) {
         document.getElementById("fileSpan").innerHTML = 'x';
-        document.getElementById("fileMessage").innerHTML = 'JPG, PNG and JPEG allowed';
+        document.getElementById("").innerHTML = 'JPG, PNG and JPEG allowed';
         return false;
     }
killedBy: Telephone validation Should be valid telephone
statusReason: Cannot set property 'innerHTML' of null

[Killed] BooleanLiteral
Zavrsni Final/registrationform/src/validator.js:114:16
     if(!supportedTypes.includes(fileType.toUpperCase())) {
         document.getElementById("fileSpan").innerHTML = 'x';
         document.getElementById("fileMessage").innerHTML = 'JPG, PNG and JPEG allowed';
-        return false;
+        return true;
     }
     document.getElementById("fileSpan").innerHTML = 'OK';
killedBy: Picture validation No picture
statusReason: expected true to equal false

[Killed] StringLiteral
Zavrsni Final/registrationform/src/validator.js:117:56
         return false;
     }
     document.getElementById("fileSpan").innerHTML = 'OK';
-    document.getElementById("fileMessage").innerHTML = 'Valid data';
+    document.getElementById("fileMessage").innerHTML = "";
     return true;
 }
killedBy: Picture validation Correct picture
statusReason: expected '' to equal 'Valid data'

[Killed] BooleanLiteral
Zavrsni Final/registrationform/src/validator.js:118:12
     }
     document.getElementById("fileSpan").innerHTML = 'OK';
     document.getElementById("fileMessage").innerHTML = 'Valid data';
-    return true;
+    return false;
 }
 
killedBy: Picture validation Correct picture
statusReason: expected false to equal true

[Killed] BlockStatement
Zavrsni Final/registrationform/src/validator.js:121:24
     return true;
 }
 
-const validate = () => {
-    var res1 = validateName();
-    var res2 = validateOccupation();
-    var res3 = validateNumber();
-    var res4 = validateTime();
-    var res5 = validatePassword();
-    var res6 = validateRepeat();
-    var res7 = validateTelephone();
-    var res8 = validatePicture(document.getElementById("picture").value);
-    if(res1 && res2 && res3 && res4 && res5 && res6 && res7) return 'OK';
-    return 'ERROR';
-}
+const validate = () => {}
 
 module.exports = {
killedBy: Submit button Submit 1
statusReason: expected undefined to equal 'ERROR'

[Killed] ConditionalExpression
Zavrsni Final/registrationform/src/validator.js:130:8
     var res6 = validateRepeat();
     var res7 = validateTelephone();
     var res8 = validatePicture(document.getElementById("picture").value);
-    if(res1 && res2 && res3 && res4 && res5 && res6 && res7) return 'OK';
+    if(false) return 'OK';
     return 'ERROR';
 }
killedBy: Submit button Submit 2
statusReason: expected 'ERROR' to equal 'OK'

[Killed] ConditionalExpression
Zavrsni Final/registrationform/src/validator.js:130:8
     var res6 = validateRepeat();
     var res7 = validateTelephone();
     var res8 = validatePicture(document.getElementById("picture").value);
-    if(res1 && res2 && res3 && res4 && res5 && res6 && res7) return 'OK';
+    if(false && res7) return 'OK';
     return 'ERROR';
 }
killedBy: Submit button Submit 2
statusReason: expected 'ERROR' to equal 'OK'
